{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar0", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "0.0078125"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "128"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv0_0_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv0_0", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv0_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv0_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "128"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_prelu0_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage1_unit1_prelu0", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_prelu1_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage1_unit1_prelu1", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_prelu2_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage1_unit1_prelu2", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[20, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv0_0_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv0_0", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv0_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv0_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "128"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_prelu0_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage2_unit1_prelu0", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_prelu1_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage2_unit1_prelu1", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_prelu2_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage2_unit1_prelu2", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[35, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv0_0_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv0_0", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv0_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv0_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "128"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_prelu0_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage3_unit1_prelu0", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_prelu1_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage3_unit1_prelu1", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_prelu2_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage3_unit1_prelu2", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[50, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_conv0_0_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_unit1_conv0_0", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_conv0_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_unit1_conv0_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "workspace": "128"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_prelu0_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage4_unit1_prelu0", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_prelu1_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage4_unit1_prelu1", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "128"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_unit1_prelu2_gamma", 
      "attrs": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "stage4_unit1_prelu2", 
      "attrs": {"act_type": "prelu"}, 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[65, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc5_weight", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc5", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "256"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "attrs": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "attrs": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "attrs": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 1], [73, 0, 1]]
    }
  ], 
  "arg_nodes": [
    0, 
    3, 
    5, 
    7, 
    9, 
    11, 
    13, 
    15, 
    17, 
    19, 
    22, 
    24, 
    26, 
    28, 
    30, 
    32, 
    34, 
    37, 
    39, 
    41, 
    43, 
    45, 
    47, 
    49, 
    52, 
    54, 
    56, 
    58, 
    60, 
    62, 
    64, 
    68, 
    70, 
    71, 
    72, 
    73
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    77
  ], 
  "heads": [[74, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}