{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn1", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar0", 
      "attr": {"scalar": "0"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar0", 
      "attr": {"scalar": "6"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar1", 
      "attr": {"scalar": "0"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar1", 
      "attr": {"scalar": "6"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar2", 
      "attr": {"scalar": "0"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar2", 
      "attr": {"scalar": "6"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "attr": {
        "__mirror_stage__": "True", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 1], [34, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 1], [41, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar3", 
      "attr": {"scalar": "0"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar3", 
      "attr": {"scalar": "6"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm4", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 1], [50, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar4", 
      "attr": {"scalar": "0"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar4", 
      "attr": {"scalar": "6"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm5", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0], [58, 0, 1], [59, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "attr": {"__mirror_stage__": "True"}, 
      "inputs": [[35, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution6_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm6", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0], [66, 0, 1], [67, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar5", 
      "attr": {"scalar": "0"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar5", 
      "attr": {"scalar": "6"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution7_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm7", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 1], [76, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar6", 
      "attr": {"scalar": "0"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar6", 
      "attr": {"scalar": "6"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm8", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0], [84, 0, 1], [85, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[61, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution9_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm9", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0], [92, 0, 1], [93, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar7", 
      "attr": {"scalar": "0"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar7", 
      "attr": {"scalar": "6"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution10_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm10", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 1], [102, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar8", 
      "attr": {"scalar": "0"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar8", 
      "attr": {"scalar": "6"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution11_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution11", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm11", 
      "attr": {
        "__mirror_stage__": "True", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[107, 0, 0], [108, 0, 0], [109, 0, 0], [110, 0, 1], [111, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution12_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution12", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm12", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0], [117, 0, 1], [118, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar9", 
      "attr": {"scalar": "0"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar9", 
      "attr": {"scalar": "6"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution13_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution13", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm13", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0], [125, 0, 0], [126, 0, 1], [127, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar10", 
      "attr": {"scalar": "0"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar10", 
      "attr": {"scalar": "6"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution14_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution14", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm14", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[132, 0, 0], [133, 0, 0], [134, 0, 0], [135, 0, 1], [136, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "attr": {"__mirror_stage__": "True"}, 
      "inputs": [[112, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution15_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution15", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm15", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0], [142, 0, 0], [143, 0, 1], [144, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar11", 
      "attr": {"scalar": "0"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar11", 
      "attr": {"scalar": "6"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution16_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution16", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[147, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm16_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm16_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm16_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm16_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm16", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0], [152, 0, 1], [153, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar12", 
      "attr": {"scalar": "0"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar12", 
      "attr": {"scalar": "6"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution17_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution17", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[156, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm17_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm17_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm17_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm17_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm17", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0], [161, 0, 1], [162, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[138, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution18_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution18", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm18_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm18_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm18_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm18_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm18", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[166, 0, 0], [167, 0, 0], [168, 0, 0], [169, 0, 1], [170, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar13", 
      "attr": {"scalar": "0"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar13", 
      "attr": {"scalar": "6"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution19_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution19", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm19_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm19_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm19_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm19_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm19", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0], [177, 0, 0], [178, 0, 1], [179, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar14", 
      "attr": {"scalar": "0"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar14", 
      "attr": {"scalar": "6"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution20_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution20", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[182, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm20_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm20_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm20_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm20_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm20", 
      "attr": {
        "__mirror_stage__": "True", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0], [186, 0, 0], [187, 0, 1], [188, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution21_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution21", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[189, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm21_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm21_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm21_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm21_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm21", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[191, 0, 0], [192, 0, 0], [193, 0, 0], [194, 0, 1], [195, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar15", 
      "attr": {"scalar": "0"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar15", 
      "attr": {"scalar": "6"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution22_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution22", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm22_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm22_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm22_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm22_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm22", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0], [202, 0, 0], [203, 0, 1], [204, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar16", 
      "attr": {"scalar": "0"}, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar16", 
      "attr": {"scalar": "6"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution23_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution23", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm23_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm23_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm23_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm23_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm23", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[209, 0, 0], [210, 0, 0], [211, 0, 0], [212, 0, 1], [213, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "attr": {"__mirror_stage__": "True"}, 
      "inputs": [[189, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution24_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution24", 
      "attr": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[215, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm24_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm24_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm24_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm24_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm24", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[217, 0, 0], [218, 0, 0], [219, 0, 0], [220, 0, 1], [221, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar17", 
      "attr": {"scalar": "0"}, 
      "inputs": [[222, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar17", 
      "attr": {"scalar": "6"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution25_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution25", 
      "attr": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[224, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm25_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm25_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm25_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm25_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm25", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[226, 0, 0], [227, 0, 0], [228, 0, 0], [229, 0, 1], [230, 0, 1]]
    }, 
    {
      "op": "_maximum_scalar", 
      "name": "_maximumscalar18", 
      "attr": {"scalar": "0"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "_minimum_scalar", 
      "name": "_minimumscalar18", 
